Case/caseFolder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-10 -20 -20) // 0
    ( 50 -20 -20) // 1
    ( 50  20 -20) // 2
    (-10  20 -20) // 3
    (-10 -20  20) // 4
    ( 50 -20  20) // 5
    ( 50  20  20) // 6
    (-10  20  20) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (8 20 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
		    (4 0 1 5)
            (7 4 5 6)
            (3 7 6 2)
            (0 3 2 1)
        );
    }
  
    front
    {
        type patch;
        faces
        (
            (7 3 0 4)
        );
    }

    back
    {
	type patch;
	faces
	(
		(5 1 2 6)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
