Case/caseFolder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }


    front
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }
    
    back 
    { 
	    type 		    freestreamPressure;
	    freestreamValue $internalField;
    }
	
	sphere_1m
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
