Case/caseFolder/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.6497;

boundaryField
{
    movingWall
    {
        type            freestream;
        freestreamValue $internalField;
    }

    front
    {
        type            freestream;
        freestreamValue $internalField;
    }

    back
    { 
	    type 		freestream;
	    freestreamValue $internalField;
    }
    
	sphere_1m
    {
        type            kqRWallFunction;
        value           $internalField;
    }

   

}

// ************************************************************************* //
