Case/caseFolder/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 33.5;

boundaryField
{
    
	movingWall
    {
        type            freestream;
        freestreamValue $internalField;
    }

    front
    {
        type            freestream;
        freestreamValue $internalField;
    }
  
    back
    {
	    type 		    freestream;
	    freestreamValue $internalField;
    }

    sphere_1m
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}

// ************************************************************************* //
